Repository: OpenChain-Project/Specification-Translation-French
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr

source: 1.1.1 A documented FOSS policy exists.
fr: 1.1.1 Il existe une politique documentée relative aux FOSS.

source: 1.1.2 A documented procedure exists that makes all Software Staff aware of the existence of the FOSS policy (e.g., via training, internal wiki, or other practical communication method).
fr: 1.1.2 Il existe une procédure documentée informant l'Equipe Logiciel de l'existence d'une politique FOSS (par exemple, via formation, wiki interne, ou autre moyen de communication).

source: 1.2.1 FOSS training materials covering the above topics exists (e.g., slide decks, online course, or other training materials).
fr: 1.2.1 Il existe un support de formation au FOSS couvrant les sujets mentionnés ci-dessus (par exemple, diapositives de présentation, cours en ligne, ou autre support de formation).

source: 1.2.2 Method of tracking the completion of the training for all Software Staff.
fr: 1.2.2 Méthode de suivi de la participation à la formation par l'Equipe Logiciel.

source: 1.2.3 At least 85% of the Software Staff are current, as per the definition in above section.
fr: 1.2.3 Au moins 85% de l'Equipe Logiciel a une formation au FOSS valide, telle que défini ci-dessus.

source: 2.1.1 FOSS Liaison function is publicly identified (e.g., via a published contact email address, or the Linux Foundation's Open Compliance Directory).
fr: 2.1.1 Le correspondant FOSS est identifiable publiquement (ex.: par une adresse email de contact publique ou via l'annuaire Open Compliance Directory de la Linux Foundation).

source: 2.1.2 An internal documented procedure exists that assigns responsibility for receiving FOSS compliance inquiries.
fr: 2.1.2 Il existe une procédure interne documentée pour attribuer la responsabilité de traiter les demandes de conformité FOSS..

source: 2.2.1 Name of persons, group or function in FOSS Compliance role(s) internally identified.
fr: 2.2.1 Il existe une liste de personnes en charge de la gestion de la conformité FOSS en interne.

source: 2.2.2 Identify source of legal expertise available to FOSS Compliance role(s) which could be internal or external.
fr: 2.2.2 L'expertise juridique, interne ou externe, accessible aux responsable de la conformité FOSS, a été identifiée.

source: 2.2.3 A documented procedure exists that assigns internal responsibilities for FOSS compliance.
fr: 2.2.3 Il existe une procédure documentée pour attribuer les responsabilités internes pour la gestion de la conformité FOSS.

source: 2.2.4 A documented procedure exists for handling the review and remediation of non-compliant cases.
fr: 2.2.4 Il existe une procédure documentée pour la vérification de la conformité et le traitement des cas de non-conformité.

source: 3.1 A process exists for creating and managing a FOSS component bill of materials which includes each component (and its Identified Licenses) in a Supplied Software release.
fr: 3.1 Il existe une procédure pour créer et gérer une liste exhaustive des composants FOSS et de leurs licences associées ("bill of materials") pour chaque version du Logiciel Fourni..

source: 3.2.1 A procedure has been implemented that handles the common FOSS license use cases for the FOSS components of each Supplied Software release.
fr: 3.2.1 Une procédure a été mise en place pour traiter les cas courants d'usage des licences FOSS pour les composants FOSS de toutes les versions du Logiciel fourni.

source: 4.1 Prepare the set of artifacts which represent the output of the FOSS management program for each Supplied Software release.
fr: 4.1 Préparer l'ensemble des livrables qui représente la sortie du programme de gestion des FOSS pour chacune des versions du Logiciel Fourni.

source: 5.1.1 A documented FOSS contribution policy exists;
fr: 5.1.1 Il existe une politique de contribution FOSS documentée ;

source: 5.1.2 A documented procedure exists that makes all Software Staff aware of the existence of the FOSS contribution policy (e.g., via training, internal wiki, or other practical communication method).
fr: 5.1.2 Une procédure documentée est en place pour porter l'existence de cette politique de contribution FOSS à la connaissance de toute l'Équipe logiciel (ex. : via des formations, un wiki interne ou tout autre moyen adapté).

source: 5.2.1 Provided the FOSS contribution policy permits contributions, a documented procedure exists that governs FOSS contributions.
fr: 5.2.1 Si la politique de contribution FOSS autorise les contributions, elle doit s'accompagner de processus documentés précisant les modalités de celles-ci.

source: 6.1.1 The organization affirms that a FOSS management program exists that meets all the requirements of this OpenChain Specification version 1.1.
fr: 6.1.1 L'entité atteste qu'elle dispose d'un programme de gestion des questions FOSS répondant à l'ensemble des exigences de la version 1.1 de la spécification Open Chain. .

source: 6.2.1 The organization affirms that a FOSS management program exists that meets all the requirements of this OpenChain Specification version 1.1 within the past 18 months of achieving conformance validation.
fr: 6.2.1 L'entité atteste disposer d'un programme de gestion des questions FOSS qui répond à l'ensemble des exigences de la spécification OpenChain dans sa version 1.1 au cours des 18 mois précédant la date de validation.

source: The policy must be internally communicated.
fr: Cette politique doit être communiquée en interne..

source: The requirements represent a base level (minimum) set of requirements a program must satisfy to be considered OpenChain Conforming.
fr: Les exigences représentent un jeu d’exigences de base (minimum) qu’un programme doit satisfaire pour être considéré Conforme à OpenChain.

source: That a procedure exists to support this activity and that the procedure is followed.
fr: , qu'il existe une procédure pour mettre en oeuvre cette activité et que cette procédure est suivie.

source: The mere meeting of a subset of these requirements would not be considered sufficient to warrant a program be OpenChain certified.
fr: La simple observation d'un sous-ensemble de ces exigences est insuffisante pour attribuer la certification Open Chain à un programme.

source: The intent is to ensure a core base level set of topics are covered but a typical training program would likely be more comprehensive than what is required here.
fr: L'intention est d'assurer qu'un ensemble clé de sujets de base est couvert mais qu'un programme typique de formation serait succeptible d'être plus complet que ce qui est réquit ici.

source: Conformance validation requirements can be found on the OpenChain project’s website.
fr: Les critères de validation de la conformité sont disponibles sur le site Web du projet OpenChain.

source: Depending on the organization, that may include (but is not limited to) software developers, release engineers, quality engineers, product marketing and product management.
fr: En fonction des organisations, ceci peut inclure (mais n'est pas limité à) les développeurs logiciel, les ingénieurs de version, les ingénieurs qualité, les responsables produit et marketing produit.

source: A bill of materials is needed to support the systematic review of each component’s license terms to understand the obligations and restrictions as it applies to the distribution of the Supplied Software.
fr: Cette liste est nécessaire au contrôle systématique des termes des licences des composants afin d'appréhender correctement l'ensemble des obligations et restrictions qui en découlent dans le cadre de la distribution du Logiciel fourni.

source: A description of the SPDX specification can be found at www.spdx.org.
fr: Une description de la spécification SPDX peut être trouvée sur le site www.spdx.org.

source: A documented procedure exists for identifying, tracking and archiving information about the collection of FOSS components from which a Supplied Software release is comprised.
fr: Il existe une procédure documentée pour identifier, tracer et archiver les informations sur l'ensemble des composants FOSS inclus dans chaque version publiée du Logiciel fourni.

source: A documented procedure exists that ensures the Compliance Artifacts are prepared and distributed with Supplied Software release as required by the Identified Licenses.
fr: Il existe une procédure documentée qui assure que les Livrables de Conformité sont préparés et distribués avec les versions du Logiciel Fourni comme requis par les Licences Identifiées.

source: A documented procedure exists to review and document the obligations, restrictions and rights granted by each Identified License governing the Supplied Software.
fr: Il existe une procédure documentée pour revoir et renseigner les obligations, restrictions et droits accordés par chacune des Licences Identifiées gouvernant le Logiciel Fourni.

source: A process exists for reviewing the Identified Licenses to determine the obligations, restrictions and rights granted by each license.
fr: Il existe un processus pour revoir les Licences Identifiées pour déterminer leurs obligations, restrictions et droits accordés par chacune des licences.

source: A process exists for the resolution of FOSS compliance issues.
fr: Un processus est en place pour résoudre les problèmes de conformité FOSS.

source: A study group was formed to consider whether a standard program specification could be created that would: i) facilitate greater quality and consistency of open source compliance information being shared across the industry; and ii) decrease the high transaction costs associated with open source resulting from compliance rework.
fr: Un groupe d’étude fût formé pour évaluer si une spécification d’un programme standard pourrait être créée qui permettrait de : i) faciliter une meilleure qualité et cohérence des informations de conformité open source partagées au travers de l’industrie ; et ii) diminuer les coûts importants associés à l’open source résultant de la nécessité de revoir la conformité.

source: A test may be used to allow Software Staff to satisfy the training requirement.
fr: Un test peut être utilisé pour permettre à l'Equipe Logiciel de satisfaire cette exigence de formation.

source: A written FOSS policy exists that governs FOSS license compliance of the Supplied Software distribution.
fr: Il existe une politique formelle relative aux FOSS qui régit la conformité aux licences FOSS pour la distribution du Logiciel Fourni.

source: A written policy exists that governs contributions to FOSS projects by the organization.
fr: Il existe une politique formelle pour cadrer les contributions de l'entité aux projets FOSS.

source: Appendix I: Language Translations
fr: Annexe I : Traductions

source: As a consequence, at each tier of the supply chain, downstream organizations were frequently redoing the compliance work already performed by other upstream organizations.
fr: En conséquence, à chaque maillon de la chaîne de fournisseurs, les organisations avales refaisaient régulièrement le travail de conformité déjà réalisé par les organisations amonts.

source: Assign individual(s) responsible for managing internal FOSS compliance.
fr: Attribuez à une ou plusieurs personnes la responsabilité de la gestion de la conformité FOSS en interne.

source: Assign individual(s) responsible for receiving external FOSS inquiries;
fr: Attribuez à une ou plusieurs personne la responsabilité de traiter les demandes FOSS externes ;

source: Assign responsibilities to develop and maintain FOSS compliance policy and processes;
fr: Attribuez les responsabilités pour définir et tenir à jour la politique et les processus de conformité FOSS ;

source: Basics of Intellectual Property law pertaining to FOSS and FOSS licenses;
fr: Les bases de la Propriété Intellectuelle en relation avec le FOSS et les licences FOSS ;

source: Because OpenChain functions as an open source project translations are driven by those willing to contribute their time and expertise to perform translations under the terms of the CC-BY 4.0 license and the project’s translation policy.
fr: OpenChain fonctionne comme un projet Open Source : les traductions sont assurées par des volontaires souhaitant y consacrer leur temps et leur expertise, et placer le résultat sous licence CC-BY 4.0, selon la politique de traduction du projet.

source: Commercially reasonable budget has been allocated.
fr: Un budget raisonnable du point de vue commercial lui est consacré .

source: Conformance with this version of the specification will last 18 months from the date conformance validation was achieved.
fr: La conformité avec cette version de la spécification dure 18 mois à partir de la date de la validation de cette conformité. .

source: Copies of the Compliance Artifacts of the Supplied Software release are archived and easily retrievable, and the archive is planned to exist for at least as long as the Supplied Software is offered or as required by the Identified Licenses (whichever is longer).
fr: Des copies des Livrables de Conformité de la version du Logiciel Fourni sont archivées et facilement accessibles, et une archive est planifiée pour être disponible tant que le Logiciel Fourni est offert ou que ceci est requis par les Licences Identifiées (le plus long des deux).

source: Definitions
fr: Définitions

source: Ensure an organization has given reasonable consideration to developing a policy with respect to publicly contributing to FOSS. The FOSS contribution policy can be made a part of the overall FOSS policy of an organization or be its own separate policy. In the situation where contributions are not permitted at all, a policy should exist making that position clear.
fr: Assurez-vous que l'entité a suffisamment pris en compte la question de la contribution aux projets FOSS publics et d’élaborer une politique à ce sujet. Cette politique de contribution FOSS peut faire partie de la politique FOSS générale ou constituer un document distinct. Pour les cas où les contributions sont systématiquement interdites, une politique doit expliciter cette position.

source: Ensure there is a reasonable way for third parties to contact the organization with regard to FOSS compliance inquiries and that this responsibility has been effectively assigned.
fr: Assurez-vous qu'il soit raisonnablement facile à un tiers de contacter l'entité pour lui adresser ses demandes relatives à la conformité FOSS et que la responsabilité de les traiter a bien été attribuée..

source: Ensure an organization has a documented process for how the organization publicly contributes FOSS. A policy may exist such that contributions are not permitted at all.
fr: Assurez-vous que l'entité dispose de processus documentés pour contribuer aux projets FOSS publics. Il se peut que la politique en la matière soit d'interdire toute contribution.

source: Ensure certain FOSS responsibilities have been effectively assigned.
fr: Assurez-vous que les responsabilités pour la gestion de la conformité FOSS ont bien été attribuées.

source: Ensure steps were taken to create, record and make Software Staff aware of the existence of a FOSS policy. Although no requirements are provided here on what should be included in the policy, other sections may impose requirements on the policy.
fr: S'assurer que l'Equipe Logiciel ait été informée de l'existence d'une politique FOSS. Bien qu'aucune exigence ne soit fournie ici sur ce que la politique devrait contenir, d'autres sections peuvent définir des exigences sur son contenu.

source: Ensure the Software Staff have recently attended FOSS training and that a core set of relevant FOSS topics are covered.
fr: S'assurer que l'Equipe Logiciel a récemment participé à la formation FOSS et qu'un ensemble clé des sujets liés au FOSS est couvert.

source: Ensure the complete collection of Compliance Artifacts accompany the Supplied Software as required by the Identified Licenses that govern the Supplied Software along with other reports created as part of the FOSS review process.
fr: S'assurer qu'une collection complète des Livrables de Conformité ainsi que les rapports créés dans le cadre du processus de revue des FOSS accompagnent le Logiciel Fourni comme requis par les Licences Identifiées qui gouvernent le Logiciel Fourni.

source: FOSS Liaison must make commercially reasonable efforts to respond to FOSS compliance inquiries as appropriate; and
fr: Le correspondant FOSS doit s'appliquer, dans une limite raisonnable d'un point de vue commercial, à traiter correctement les demandes de conformité FOSS ; et

source: FOSS Liaison - a designated person who is assigned to receive external FOSS inquires.
fr: Contact FOSS - une personne chargée de recevoir les demandes externes de renseignement sur les FOSS.

source: FOSS compliance management activity is sufficiently resourced:
fr: L'activité de conformité FOSS doit disposer de ressources suffisantes :

source: FOSS component records exist for each Supplied Software release which demonstrates the documented procedure was properly followed.
fr: Il existe des documents relatifs aux composants FOSS pour chacune des version publiée du Logiciel fourni, montrant que la procédure documentée a été suivie correctement.

source: FOSS licensing concepts (including the concepts of permissive and copyleft licenses);
fr: Les concepts de licences FOSS (y compris les concept de licence permissive et copyleft) ;

source: FOSS project licensing models;
fr: Les modèles de licences de projet FOSS ;

source: FOSS (Free and Open Source Software) - software subject to one or more licenses that meet the Open Source Definition published by the Open Source Initiative (OpenSource.org) or the Free Software Definition (published by the Free Software Foundation) or similar license.
fr: FOSS (Free and Open Source Software, logiciel libre et/ou open source) - logiciel soulmis à une ou plusieurs licences qui respecte l'Open Source Definition publiée par l'Open Source Initiative (OpenSource.org) ou la Free Software Definition (publiée par la Free Software Foundation) ou licence similaire.

source: G1: Know Your FOSS Responsibilities
fr: G1: Connaître vos responsabilités vis à vis des FOSS

source: G2: Assign Responsibility for Achieving Compliance
fr: G2: Attribuer les responsabilités pour atteindre la conformité

source: G3: Review and Approve FOSS Content
fr: G3: Contrôler et valider le contenu FOSS

source: G4: Deliver FOSS Content Documentation and Artifacts
fr: G4: Fourniture des Documentations et Livrables FOSS

source: G5: Understand FOSS Community Engagement
fr: G5: Comprendre l'implication dans les communautés FOSS

source: G6: Certify Adherence to OpenChain Requirements
fr: G6: Attester sa conformité aux exigences d'OpenChain

source: Identified Licenses - a set of FOSS licenses identified as a result of following an appropriate method of identifying such licenses.
fr: Licences Identifiées - un ensemble de licences FOSS identifiées comme résultat d'une méthode appropriée d'identification de telles licences.

source: Identify Internal FOSS Compliance Role(s).
fr: Créez un rôle de responsable de la conformité FOSS interne.

source: Identify FOSS Liaison Function ("FOSS Liaison").
fr: Créez un rôle de Correspondant FOSS("Correspondant FOSS").

source: If all the requirements have been met for a given program, it would be considered OpenChain Conforming in accordance with version 1.1 of the specification. Verification Artifacts are not intended to be public, but could be provided under NDA or upon private request from the OpenChain organization to validate conformance.
fr: Si toutes les exigences ont été satisfaites pour un programme donné, il sera considéré Conforme à OpenChain en accord avec la version 1.1 de cette spécification. Les Artéfacts de Vérification ne sont pas destinés à être publics, mais pourraient être fournis sous --Accord de Confidentialité-- ou sur demande privée de l'organisation OpenChain pour valider la conformité.

source: If an organization permits contributions to FOSS projects then a process must exist that implements the FOSS contribution policy outlined in Section 5.1.
fr: Si l'entité autorise les contributions aux projets FOSS, elle doit mettre en place les processus pour implémenter la politique de contribution FOSS mentionnée à la Section 5.1 .

source: In accordance with the Vision and Mission, this specification defines a set of requirements that if met, would significantly increases the probability that an open source compliance program had achieved a sufficient level of quality, consistency and completeness; although a program that satisfies all the specification requirements does not guarantee full compliance.
fr: En accord avec la Vision et la Mission, cette spécification définit un jeu d’exigences qui, si satisfaites, améliorera significativement la probabilité qu’un programme de conformité open source ait achevé un niveau suffisant de qualité, cohérence et complétude ; bien qu’un programme qui satisfasse toutes les exigences de la spécification ne garantisse pas une conformité complète.

source: In order for an organization to be OpenChain certified, it must affirm that it has a FOSS management program that meets the criteria described in this OpenChain Specification version 1.1.
fr: Pour être certifiée OpenChain, une entité doit attester disposer d'un programme de gestion des questions FOSS qui réponde aux critères énoncés dans la présente version 1.1 de la spécification OpenChain .

source: In that situation it is understood that no procedure may exist and this requirement would nevertheless be met.
fr: Dans de tels cas, l'absence de processus dédiés est légitime et la présente exigence sera considérée comme respectée..

source: It is important for the organization to remains current with the specification if they want to assert program conformance overtime. This requirement ensures that the program’s supporting processes and controls do not erode if they want to continue to assert conformance with the specification overtime.
fr: Il est important que l'entité reste en phase avec la spécification si elle souhaite continuer à pouvoir afficher sa conformité. Cette exigence permet de garantir que les processus implémentant le programme de conformité et leur vérification ne se dégradent pas avec le temps.

source: Legal expertise pertaining to FOSS compliance is accessible to the FOSS Compliance role (e.g., could be internal or external); and
fr: Le ou les responsables de la conformité FOSS doivent avoir accès à l'expertise juridique nécessaire (elle peut être interne ou externe ); et

source: Mandatory FOSS training for all Software Staff exists such that:
fr: Il existe une formation sur le FOSS, obligatoire pour l"Equipe Logiciel, qui :

source: Mission: Establish requirements to achieve effective management of free/open source software (FOSS) for software supply chain participants, such that the requirements and associated collateral are developed collaboratively and openly by representatives from the software supply chain, open source community, and academia.
fr: Mission: Etablir les exigences pour atteindre une gestion efficace des logiciels libre et/ou open source pour les participants de la chaîne de fournisseurs de logiciel, afin que les exigences et garanties associées soient développées collaborativement et ouvertement par les représentants de la chaîne de fournisseurs de logiciel, la communauté open source, et le monde universitaire.

source: OpenChain Conforming - a program that satisfies all the requirements of this specification.
fr: Conforme à OpenChain - un programme qui satisfait toutes les exigences de cette spécification.

source: OpenChain Specification
fr: Spécifications OpenChain

source: OpenChain Specification 1.1
fr: Spécifications OpenChain 1.1
